{
  "name": "RESTful APIs",
  "chunk_array": [
    "The name of the candidate is RESTful APIs. The section title is profile. Section details - Deepanshu Dhingra, Software Engineer Bengaluru, 560034, +91 8178023846, deepanshudhingra98@gmail.com S K I L L S Java SpringBoot C++ MySQL MongoDB RabbitMQ AWS (ECS, EC2, ALB) Micro-services Distributed Systems Git E M P L OY M E N T H I S TO RY Dec 2022 — Present SDE1, Mygate Bengaluru 1. Part of theAd Platformteam responsible for facilitating brand integration with MyGate. 2. Implemented ad servingalgorithms and logicto ensure the right ads were displayed to the right users at the right time. 3. Spearheaded development and maintenance of RESTful APIs 4. Optimized application performancefor enhanced user experience 5. Ensured system stability by actively monitoringmicro serviceswithAWS cloud watchandnew Relic and promptly addressing issues within the ad platform, minimizing downtime from 10 minutes to 0. 6. Led the successfulend-to-end deliveryof aninternal lead generation systemwhich achieved an impressive35% cost reduction. 7. Enhanced Brand experiencethrough MyGate Ad Platform by spearheading the development of a robust CRM integrationsolution bridging the gap between brands and MyGate. 8. Prepared comprehensive documentation for backend systems, APIs, and processes to facilitate knowledge sharing and onboarding of new team members. 9. Designed and implementedvoice pre-approvalfeature thatsecured the 3rd prizein hackathon and was subsequently chosen for production release. Jul 2021 — Dec 2022 Software Engineer, JK Technosoft Noida 1. Played a key role in automating consignment management for a UK client by assisting in the implementation of a Warehouse Management System. The system was primarily built on theJava Spring-bootframework and predominantly utilizedMYSQLas its back-end data store. 2. Enhanced theWarehouse Management Web Applicationby maintaining a robust Restful API, streamlining inventory management processes. I N T E R N S H I P S Jan 2021 — Jul 2021 Problem Setter, CodingNinjas Gurgaon 1. Contributed30+ DSAproblems with proper test cases for Code-Studio. 2. Delivered Software Engineering blogs. 3. Managed a team of4 Technical Blog Writers, providing guidance on new DSA (Data Structures and Algorithms) problems and approaches to enhance content quality and relevance E D U C AT I O N Jul 2016 — Nov 2020 Btech -YMCA University of Science And Technology Jul 2015 — Jul 2016 AISSCE (CLass XII) CBSE -St. Thomas Sr. Sec. School Jul 2013 — Jul 2014 (Class X) CBSE -St. Thomas Sr. Sec. School L I N K S LinkedIn -https://www.linkedin.com/in/deepanshu-dhingra-2a7148131/ Leetcode -https://leetcode.com/deepanshudhingra98/ GeeksForGeeks -https://auth.geeksforgeeks.org/user/deepanshudhingra98"
  ]
}