{
  "name": "Shobit Gupta",
  "chunk_array": [
    "The name of the candidate is Shobit Gupta. The section title is Links. Section details - linkedin.com/in/shobit-gupta-3a5a9a213",
    "The name of the candidate is Shobit Gupta. The section title is profile. Section details - Shobit Gupta Software Engineer To become a successful expert in the field of Information Technology bychannelizing my technical knowledge and skills to ensure personal andprofessional growth and to contribute to the prosperity of theorganization. shobitji2@gmail.com 9419237802 Bangalore, India bitmca.org.in/",
    "The name of the candidate is Shobit Gupta. The section title is EDUCATION. Section details - 10th Army Public School 2014 - 2015, Jammu,10 CGPA 12th Army Public School 2016 - 2017, Jammu, 88.6%",
    "The name of the candidate is Shobit Gupta. The section title is B.C.A. Section details - G.G.M Science College 2017 - 2020, Jammu, 8.4 CGPA",
    "The name of the candidate is Shobit Gupta. The section title is M.C.A. Section details - Bangalore Institute of Technology 2020 - 2022, Bangalore, 9.2 CGPA",
    "The name of the candidate is Shobit Gupta. The section title is WORK EXPERIENCE. Section details - Software Development Engineer Zopsmart 03/2021, Bangalore I am appointed as a Full stack developer, where I am working on SpringBoot and Angular framework. Majorly i am contributing to Backend team in developing micro services and contributing in some minor tasks on UI Learned how an enterprise application works Learned various CI/CD and production related tools like harness, GitHub, helm, rancher, Prometheus, grafana, datadog, dynatrace and many more Campus Business Manager PrepBytes 07/2021 - 10/2021, Remote Worked as a CAMPUS BUSINESS MANAGER @PrepBytes",
    "The name of the candidate is Shobit Gupta. The section title is SKILLS. Section details - java Springboot postgreSQL MySql Angular Redux/NgRx CI/CD",
    "The name of the candidate is Shobit Gupta. The section title is PERSONAL PROJECTS. Section details - Hand Gesture Control Robot (07/2019 - 10/2019) It looks like a car which moves with the help of ourhand movement (wireless) Software/Technologies Used - Arduino Integrated DevelopmentEnvironment (IDE) , C++ , Accelerometer , Motor Driver Labor Management System(01/2020 - 04/2020) Labor Management System is a computerized system which helps user to book his/her labor that the user requires. Language Used – Html, Css , bootstrap , php , MySql Code Player(01/2021 - 03/2021) it is an online editor for HTML,CSS , JAVASCRIPT . We can write code in any mentioned language and will get desired output. Language Used - Html , Css , Javascript/Jquery College Feedback and Complaint System (07/2021 - 10/2021) Online Student feedback system which is helpful for collegeto do educational improvements. Language Used – Html, Css , Javascript , bootstrap , Laravel , MySql Url of project : https://bitmca.org.in/",
    "The name of the candidate is Shobit Gupta. The section title is CERTIFICATES. Section details - Certificate of Organization(10/2021 - 10/2021) Organized a Technical Webinar in My college on the topic of : HOW TO CRACK TECHNICAL INTERVIEWS Build a face recognition app using Python (04/2021 - 2022) Build a face recognition app using Python as a part ofAI-for- India Event",
    "The name of the candidate is Shobit Gupta. The section title is HOBBIES. Section details - Violin Playing Playing Cricket Music Production Playing Badminton Achievements/Tasks Achievements/Tasks"
  ]
}